# EdgeArrayArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArrayArray Constructor
EdgeArrayArray Class See Also
---
Initializes a new instance of the EdgeArrayArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EdgeArrayArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
EdgeArrayArray()
```

# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace